# Create Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Railing..::..Create Method
Railing Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, CurveLoop, ElementId, ElementId) | Creates a new railing by specifying the railing path in the project document. |
| Create(Document, ElementId, ElementId, RailingPlacementPosition) | Automatically creates new railings with the specified railing type on all sides of a stairs or ramp element. |
| Create(Document, ElementId, ElementId, ElementId, RailingPlacementPosition) | Creates new railings with the specified railing type on all sides of a stairs instance in a MultistoryStairs element. |

# See Also
Railing Class
Railing Members
Autodesk.Revit.DB.Architecture Namespace